IBM/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          0.05;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

libs
(
    "liblduSolvers.so"
    "libimmersedBoundary.so"
);

functions
(
    forces
    {
        type               forces;
        functionObjectLibs ("libforces.so");

        outputControl timeStep;
        outputInterval 1;
        patches ( ibCylinder );

        pName       p;
        UName       U;
        rhoName     rhoInf;
        rhoInf      1;

        log         true;
        CofR        ( 0 0 0 );

        Aref 0.16;
        Uref 1;
    }
Forces1
{
               type               forceCoeffs;
        functionObjectLibs ("libforces.so");

        outputControl timeStep;
        outputInterval 1;
        patches ( ibCylinder );

        pName       p;
        UName       U;
        rhoName     rhoInf;
        rhoInf      1;

        log         true;
        CofR        ( 0 0 0 );
	liftDir     (0 1 0);;
        dragDir     (1 0 0);
        pitchAxis   (0 0 1);

        Aref 0.16;
       magUInf     1;
        lRef        2;
}

);


// ************************************************************************* //
