IBM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-20 20 -0.04)
    (-3 20 -0.04)
    (3 20 -0.04)
    (30 20 -0.04)
    (-20 3 -0.04)
    (-3 3 -0.04)
    (3 3 -0.04)
    (30 3 -0.04)
    (-20 -3 -0.04)
    (-3 -3 -0.04)
    (3 -3 -0.04)
    (30 -3 -0.04)
    (-20 -20 -0.04)
    (-3 -20 -0.04)
    (3 -20 -0.04)
    (30 -20 -0.04)

    (-20 20 0.04)
    (-3 20 0.04)
    (3 20 0.04)
    (30 20 0.04)
    (-20 3 0.04)
    (-3 3 0.04)
    (3 3 0.04)
    (30 3 0.04)
    (-20 -3 0.04)
    (-3 -3 0.04)
    (3 -3 0.04)
    (30 -3 0.04)
    (-20 -20 0.04)
    (-3 -20 0.04)
    (3 -20 0.04)
    (30 -20 0.04)
);

blocks
(
    hex (4 5 1 0 20 21 17 16) (60 60 1) simpleGrading (0.25 4 1)
hex (5 6 2 1 21 22 18 17) (60 60 1) simpleGrading (1 4 1)
hex (6 7 3 2 22 23 19 18) (80 60 1) simpleGrading (6 4 1)

hex (8 9 5 4 24 25 21 20) (60 60 1) simpleGrading (0.25 1 1)
hex (9 10 6 5 25 26 22 21) (60 60 1) simpleGrading (1 1 1)
hex (10 11 7 6 26 27 23 22) (80 60 1) simpleGrading (6 1 1)

hex (12 13 9 8 28 29 25 24) (60 60 1) simpleGrading (0.25 0.25 1)
hex (13 14 10 9 29 30 26 25) (60 60 1) simpleGrading (1 0.25 1)
hex (14 15 11 10 30 31 27 26) (80 60 1) simpleGrading (6 0.25 1)

);

edges
(
);

patches
(
    patch in
    (
	(0 4 20 16)
	(4 8 24 20)
	(24 8 12 28)

    )
    patch out
    (
        (3 19 23 7)
	(7 23 27 11)
	(11 27 31 15)
    )
    patch top
    (
	(0 16 17 1)
	(1 17 18 2)
	(2 18 19 3)
    )
    patch bottom
    (
        (12 13 29 28) 
	(13 14 30 29) 
	(14 15 31 30)

    )
    empty frontAndBack
    (
	(17 16 20 21)
	(18 17 21 22)
	(19 18 22 23)
	(21 20 24 25)
	(22 21 25 26)
	(23 22 26 27)
	(25 24 28 29)
	(26 25 29 30)
	(27 26 30 31)
	(4 5 1 0)
	(5 6 2 1)
	(6 7 3 2)
	(8 9 5 4)
	(9 10 6 5)
	(10 11 7 6)
	(12 13 9 8)
	(13 14 10 9)
	(14 15 11 10)

    )
);

mergePatchPairs
(
);


// ************************************************************************* //
