IBM/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           CG;
        preconditioner   Cholesky;

        minIter          1;
        maxIter          1000;
        tolerance        1e-06;
        relTol           0.01;
    }
    pFinal
    {
        $p;
        relTol           0;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   ILU0;

        minIter          1;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
}

PISO
{
    nCorrectors 2;
    nNonOrthogonalCorrectors 1;

    pRefPoint (0.1 0 0);
    pRefValue 0;
}


// ************************************************************************* //
